resources/xsd/reimari/haeturvalaiteryhmat-vastaus.xml

<?xml version="1.0" encoding="utf-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body>
    <HaeTurvalaiteryhmat xmlns="http://www.liikennevirasto.fi/xsd/harja/reimari">
        <HaeTurvalaiteryhmatResponse>
            <turvalaiteryhma tunnus="1234" nimi="Merireimari" kuvaus="1234: Merireimari">
                <turvalaitteet>
                    <turvalaite nro="5678" nimi="Michelsöharun" ryhma="1234" />
                    <turvalaite nro="5679" nimi="Huldviksgrund" ryhma="1234" />
                    <turvalaite nro="5670" nimi="Klobben ylempi" ryhma="1234" />
                    <turvalaite nro="5671" nimi="Svartholm ylempi" ryhma="1234" />
                </turvalaitteet>
            </turvalaiteryhma>
        </HaeTurvalaiteryhmatResponse>
    </HaeTurvalaiteryhmat>
</S:Body></S:Envelope>



